/**
 * Интерфейс данных о месте работы
 */
export interface IEmployment {
    /**
     * Уникальный идентификатор места работы
     */
    id: string;

    /**
     * Название компании предоставляющей место работы
     */
    name: string;
}

/**
 * Интерфейс адреса работодателя
 */
export interface IAddress {
    /**
     * Город расположения офиса/здания
     */
    city: string;

    /**
     * Улица расположения офиса/здания
     */
    street: string;

    /**
     * Строение
     */
    building: string;

    /**
     *
     */
    lat: number;

    /**
     *
     */
    lng: number;

    /**
     * Описание адреса(как проехать и тд)
     */
    description: null;

    /**
     *
     */
    raw: string;

    /**
     * Ближайшее до адреса станция метро
     */
    metro: null;

    /**
     * Массив станций метро
     */
    metro_stations: any[];

    /**
     * Уникальный идентификатор адреса
     */
    id: string;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface IArea {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    id: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    name: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    url: string;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface ILogoUrls {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    '90': string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    '240': string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    original: string;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface IEmployer {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    id: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    name: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    alternate_url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    logo_urls: ILogoUrls | null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    vacancies_url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    accredited_it_employer: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    trusted: boolean;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface ISalary {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    from: number;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    to: number | null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    currency: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    gross: boolean;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface ISnippet {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    requirement: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    responsibility: string;
}

/**
 * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
 */
export interface IItem {
    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    id: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    premium: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    name: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    department: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    has_test: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    response_letter_required: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    area: IArea;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    salary: ISalary;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    description: string | null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    type: IEmployment;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    address: IAddress | null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    response_url: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    sort_point_distance: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    published_at: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    created_at: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    archived: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    apply_alternate_url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    insider_interview: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    alternate_url: string;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    relations: any[];

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    employer: IEmployer;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    snippet: ISnippet;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    contacts: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    schedule: IEmployment;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    working_days: any[];

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    working_time_intervals: IEmployment[];

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    working_time_modes: IEmployment[];

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    accept_temporary: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    professional_roles: IEmployment[];

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    accept_incomplete_resumes: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    experience: IEmployment;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    employment: IEmployment;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    adv_response_url: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    is_adv_vacancy: boolean;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    adv_context: null;

    /**
     * Интерфейс данных полученных из APU hh.ru, представленных в виде параметров карточки вакансии
     */
    show_logo_in_search?: null;
}

/**
 * Интерфейс данных полученных от API
 */
export interface IApiData {
    /**
     * Массив записей с типом IItem содержащим структуру данных получаемых от API
     */
    items: IItem[];

    /**
     * Кол-во найденных по заданным параметрам(фильтрам) записей
     */
    found: number;

    /**
     * Кол-во страниц доступных по заданным параметрам(фильтрация и PER_PAGE)
     */
    pages: number;

    /**
     * Кол-во записей в одной странице(задается в api.config.ts)
     */
    per_page: number;

    /**
     * Нынешний номер страницы
     */
    page: number;

    /**
     * Нынешний номер страницы
     */
    clusters: null;

    /**
     * Заданные аргументы в запрос
     */
    arguments: null;

    /**
     *
     */
    fixes: null;

    /**
     *
     */
    suggests: null;

    /**
     * Альтернативная URL для получения данных из API
     */
    alternate_url: string;
}
